index.org
#+TITLE:How to share data to avoid misunderstanding 
#+AUTHOR: Ivan Hanigan
#+email: ivan.hanigan@anu.edu.au
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LATEX: \tableofcontents
-----

* COMMENT TODO-list
** TODO check back on jtleeks orignal plus comments and issues to make sure I capture any new stuff from them
** TODO make clear the bits about data sharers vs data sharees
** TODO how to include a section on ethics?
* COMMENT layout
** default
#+name:aboutus
#+begin_src html :tangle _layouts/default.html :exports none :eval no
  <!doctype html>
  <html>
    <head>
      <meta charset="utf-8">
      <meta http-equiv="X-UA-Compatible" content="chrome=1">
      <title>DataSharing - {{ page.title }}</title>
  
      <link rel="stylesheet" href="stylesheets/styles.css">
      <link rel="stylesheet" href="stylesheets/pygment_trac.css">
      <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
      <!--[if lt IE 9]>
      <script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script>
      <![endif]-->
    </head>
    <body>
      <div class="wrapper">
        <header>
          <!--<h1>DataSharing</h1>-->
          <strong id="blog-title">
            <a href="/datasharing/" rel="home"><h1>DataSharing</h1></a>
          </strong>
          <!--<p>datasharing</p>-->
  
                <p>Bunch of links:</p>
                <a class="Contact the project" href="mailto:ivan.hanigan@gmail.com">Contact the project →</a>  
                <!--<p></p>-->
                <!--<a class="Font of all wisdom" href="www.google.com">Font of all wisdom →</a>-->  
                <p></p>
                <a class="Index" href="/datasharing/index.html">About →</a>
                <!--<a class="About" href="/aboutus.html">About →</a>-->  
                <!--<p><a class="Document" href="/datasharing/datasharing.html">Document →</a></p>-->
  
  
  
        </header>
        <section>
          <h3>{{ page.title }}</h3>
  
  <!--<p>This was generated by Github's automatic webpage generator.</p>-->
  
  <p>
            {{ content }}
  </p>
  <div id="disqus_thread"></div>
    <script type="text/javascript" src="http://disentanglethings.disqus.com/embed.js"> </script>
    <noscript>Please enable JavaScript to <a href="http://disentanglethings.disqus.com/?url=ref">view the discussion thread.</a></noscript>
        </section>
        <footer>
          <p>This project is maintained by <a href="https://github.com/ivanhanigan">ivanhanigan</a></p>
          <p><small>Hosted on GitHub Pages &mdash; Theme by <a href="https://github.com/orderedlist">orderedlist</a></small></p>

  
        </footer>
      </div>
  
  
  
      <script src="javascripts/scale.fix.js"></script>    
    </body>
  </html>
  
#+end_src


* Index
#+name:index
#+begin_src markdown :tangle index.md :exports reports :eval no :padline no
--- 
name: index
layout: default
title: Index
---

This is a guide for anyone who needs to share data with another analyst and wants to avoid the other person misunderstanding the data.

- [Introduction](/introduction)
- [Least Publishable Units (LPU)](/least-publishable-units)
- [Exploratory Data Analysis](/eda)

#+end_src

* Introduction
#+name:index
#+begin_src markdown :tangle introduction.md :exports reports :eval no :padline no
--- 
name: introduction
layout: default
title: Introduction
---

This is a guide for anyone who needs to share data with another analyst and wants to avoid the other person misunderstanding the data. This is based on the original by Jeff Leek at [[https://github.com/jtleek/datasharing]].  The following is a working document in which I will modify the original words to suit my own purposes (and hopefully are generalisable for others too).  For now the following is still the original. 

The target audiences in mind are:

- Scientific collaborators who need statisticians to analyze data for them
- Students or postdocs in scientific disciplines looking for consulting advice
- Junior statistics students whose job it is to collate/clean data sets

The goals of this guide are to provide some instruction on the best way to share data to avoid the most common pitfalls
and sources of delay in the transition from data collection to data analysis. 

The original author of this material is [Jeff Leek](http://biostat.jhsph.edu/~jleek/) who says:  
_My_ group works with a large
number of collaborators and the number one source of variation in the speed to results is the status of the data
when they arrive at the Leek group. Based on my conversations with other statisticians this is true nearly universally.

My strong feeling is that statisticians should be able to handle the data in whatever state they arrive. It is important
to see the raw data, understand the steps in the processing pipeline, and be able to incorporate hidden sources of
variability in one's data analysis. On the other hand, for many data types, the processing steps are well documented
and standardized. So the work of converting the data from raw form to directly analyzable form can be performed 
before calling on a statistician. This can dramatically speed the turnaround time, since the statistician doesn't
have to work through all the pre-processing steps first. 

#+end_src
* Least Publishable Units (LPU)

#+name:least-publishable-units
#+begin_src markdown :tangle least-publishable-units.md :exports reports :eval no :padline no
--- 
name: least-publishable-units
layout: default
title: Least Publishable Units (LPU)
---

- The concept of Least Publishable Units (LPU) allows us to compartmentalise portions of data collections into a subcollection called the LPU (also 'the dataset'). 
- Each LPU may contain more than one data file that are logically, scientifically or thematically
related. 
- A LPU may need to be constructed from merging or modification of the existing files

#+end_src

* Data Sharer
** What you should deliver to the statistician


For maximum speed in the analysis this is the information you should pass to a statistician:

1. The raw data.
2. A [tidy data set](http://vita.had.co.nz/papers/tidy-data.pdf) 
3. A code book describing each variable and its values in the tidy data set.  
4. An explicit and exact recipe you used to go from 1 -> 2,3 

Let's look at each part of the data package you will transfer. 


*** The raw data

It is critical that you include the rawest form of the data that you have access to. Here are some examples of the
raw form of data:

- The strange [binary file](http://en.wikipedia.org/wiki/Binary_file) your measurement machine spits out
- The unformatted Excel file with 10 worksheets the company you contracted with sent you
- The complicated [JSON](http://en.wikipedia.org/wiki/JSON) data you got from scraping the [Twitter API](https://twitter.com/twitterapi)
- The hand-entered numbers you collected looking through a microscope

You know the raw data is in the right format if you: 

1. Ran no software on the data
1. Did not manipulate any of the numbers in the data
1. You did not remove any data from the data set
1. You did not summarize the data in any way

If you did any manipulation of the data at all it is not the raw form of the data. Reporting manipulated data
as raw data is a very common way to slow down the analysis process, since the analyst will often have to do a
forensic study of your data to figure out why the raw data looks weird. 

