index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>How to share data to avoid misunderstanding </title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="How to share data to avoid misunderstanding "/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-27T22:23+1100"/>
<meta name="author" content="Ivan Hanigan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">How to share data to avoid misunderstanding </h1>


<hr/>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 What you should deliver to the statistician</a>
<ul>
<li><a href="#sec-2-1">2.1 The raw data</a></li>
<li><a href="#sec-2-2">2.2 The tidy data set</a></li>
<li><a href="#sec-2-3">2.3 The code book</a></li>
<li><a href="#sec-2-4">2.4 How to code variables</a></li>
<li><a href="#sec-2-5">2.5 The instruction list/script</a></li>
</ul>
</li>
<li><a href="#sec-3">3 What you should expect from the analyst</a></li>
<li><a href="#sec-4">4 Acknowledgements</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">

<p>This is a guide for anyone who needs to share data with another analyst and wants to avoid the other person misunderstanding the data. This is based on the original by Jeff Leek at <a href="https://github.com/jtleek/datasharing">https://github.com/jtleek/datasharing</a>.  The following is a working document in which I will modify the original words to suit my own purposes (and hopefully are generalisable for others too).  For now the following is still the original. 
</p>
<p>
The target audiences in mind are:
</p>
<ul>
<li>Scientific collaborators who need statisticians to analyze data for them
</li>
<li>Students or postdocs in scientific disciplines looking for consulting advice
</li>
<li>Junior statistics students whose job it is to collate/clean data sets
</li>
</ul>


<p>
The goals of this guide are to provide some instruction on the best way to share data to avoid the most common pitfalls
and sources of delay in the transition from data collection to data analysis. 
</p>
<p>
The original author of this material is [Jeff Leek](<a href="http://biostat.jhsph.edu/~jleek/">http://biostat.jhsph.edu/~jleek/</a>) who says:  
<span style="text-decoration:underline;">My</span> group works with a large
number of collaborators and the number one source of variation in the speed to results is the status of the data
when they arrive at the Leek group. Based on my conversations with other statisticians this is true nearly universally.
</p>
<p>
My strong feeling is that statisticians should be able to handle the data in whatever state they arrive. It is important
to see the raw data, understand the steps in the processing pipeline, and be able to incorporate hidden sources of
variability in one's data analysis. On the other hand, for many data types, the processing steps are well documented
and standardized. So the work of converting the data from raw form to directly analyzable form can be performed 
before calling on a statistician. This can dramatically speed the turnaround time, since the statistician doesn't
have to work through all the pre-processing steps first. 
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What you should deliver to the statistician</h2>
<div class="outline-text-2" id="text-2">



<p>
For maximum speed in the analysis this is the information you should pass to a statistician:
</p>
<ol>
<li>The raw data.
</li>
<li>A [tidy data set](<a href="http://vita.had.co.nz/papers/tidy-data.pdf">http://vita.had.co.nz/papers/tidy-data.pdf</a>) 
</li>
<li>A code book describing each variable and its values in the tidy data set.  
</li>
<li>An explicit and exact recipe you used to go from 1 -&gt; 2,3 
</li>
</ol>


<p>
Let's look at each part of the data package you will transfer. 
</p>


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The raw data</h3>
<div class="outline-text-3" id="text-2-1">


<p>
It is critical that you include the rawest form of the data that you have access to. Here are some examples of the
raw form of data:
</p>
<ul>
<li>The strange [binary file](<a href="http://en.wikipedia.org/wiki/Binary_file">http://en.wikipedia.org/wiki/Binary_file</a>) your measurement machine spits out
</li>
<li>The unformatted Excel file with 10 worksheets the company you contracted with sent you
</li>
<li>The complicated [JSON](<a href="http://en.wikipedia.org/wiki/JSON">http://en.wikipedia.org/wiki/JSON</a>) data you got from scraping the [Twitter API](<a href="https://twitter.com/twitterapi">https://twitter.com/twitterapi</a>)
</li>
<li>The hand-entered numbers you collected looking through a microscope
</li>
</ul>


<p>
You know the raw data is in the right format if you: 
</p>
<ol>
<li>Ran no software on the data
</li>
<li>Did not manipulate any of the numbers in the data
</li>
<li>You did not remove any data from the data set
</li>
<li>You did not summarize the data in any way
</li>
</ol>


<p>
If you did any manipulation of the data at all it is not the raw form of the data. Reporting manipulated data
as raw data is a very common way to slow down the analysis process, since the analyst will often have to do a
forensic study of your data to figure out why the raw data looks weird. 
</p>
</div>

</div>
