index.html

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> The tidy data set</h3>
<div class="outline-text-3" id="text-2-2">


<p>
The general principles of tidy data are laid out by [Hadley Wickham](<a href="http://had.co.nz/">http://had.co.nz/</a>) in [this paper](<a href="http://vita.had.co.nz/papers/tidy-data.pdf">http://vita.had.co.nz/papers/tidy-data.pdf</a>)
and [this video](<a href="http://vimeo.com/33727555">http://vimeo.com/33727555</a>). The paper and the video are both focused on the [R](<a href="http://www.r-project.org/">http://www.r-project.org/</a>) package, which you
may or may not know how to use. Regardless the four general principles you should pay attention to are:
</p>
<ol>
<li>Each variable you measure should be in one column
</li>
<li>Each different observation of that variable should be in a different row
</li>
<li>There should be one table for each "kind" of variable
</li>
<li>If you have multiple tables, they should include a column in the table that allows them to be linked
</li>
</ol>


<p>
While these are the hard and fast rules, there are a number of other things that will make your data set much easier
to handle. First is to include a row at the top of each data table/spreadsheet that contains full row names. 
So if you measured age at diagnosis for patients, you would head that column with the name `AgeAtDiagnosis` instead
of something like `ADx` or another abbreviation that may be hard for another person to understand. 
</p>

<p>
Here is an example of how this would work from genomics. Suppose that for 20 people you have collected gene expression measurements with 
[RNA-sequencing](<a href="http://en.wikipedia.org/wiki/RNA-Seq">http://en.wikipedia.org/wiki/RNA-Seq</a>). You have also collected demographic and clinical information
about the patients including their age, treatment, and diagnosis. You would have one table/spreadsheet that contains the clinical/demographic
information. It would have four columns (patient id, age, treatment, diagnosis) and 21 rows (a row with variable names, then one row
for every patient). You would also have one spreadsheet for the summarized genomic data. Usually this type of data
is summarized at the level of the number of counts per exon. Suppose you have 100,000 exons, then you would have a
table/spreadsheet that had 21 rows (a row for gene names, and one row for each patient) and 100,001 columns (one row for patient
ids and one row for each data type). 
</p>
<p>
If you are sharing your data with the collaborator in Excel, the tidy data should be in one Excel file per table. They
should not have multiple worksheets, no macros should be applied to the data, and no columns/cells should be highlighted. 
Alternatively share the data in a [CSV](<a href="http://en.wikipedia.org/wiki/Comma-separated_values">http://en.wikipedia.org/wiki/Comma-separated_values</a>) or [TAB-delimited](<a href="http://en.wikipedia.org/wiki/Tab-separated_values">http://en.wikipedia.org/wiki/Tab-separated_values</a>) text file.
</p>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> The code book</h3>
<div class="outline-text-3" id="text-2-3">


<p>
For almost any data set, the measurements you calculate will need to be described in more detail than you will sneak
into the spreadsheet. The code book contains this information. At minimum it should contain:
</p>
<ol>
<li>Information about the variables (including units!) in the data set not contained in the tidy data 
</li>
<li>Information about the summary choices you made
</li>
<li>Information about the experimental study design you used
</li>
</ol>


<p>
In our genomics example, the analyst would want to know what the unit of measurement for each
clinical/demographic variable is (age in years, treatment by name/dose, level of diagnosis and how heterogeneous). They 
would also want to know how you picked the exons you used for summarizing the genomic data (UCSC/Ensembl, etc.). They
would also want to know any other information about how you did the data collection/study design. For example,
are these the first 20 patients that walked into the clinic? Are they 20 highly selected patients by some characteristic
like age? Are they randomized to treatments? 
</p>
<p>
A common format for this document is a Word file. There should be a section called "Study design" that has a thorough
description of how you collected the data. There is a section called "Code book" that describes each variable and its
units. 
</p>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> How to code variables</h3>
<div class="outline-text-3" id="text-2-4">


<p>
When you put variables into a spreadsheet there are several main categories you will run into depending on their [data type](<a href="http://en.wikipedia.org/wiki/Statistical_data_type">http://en.wikipedia.org/wiki/Statistical_data_type</a>):
</p>
<ol>
<li>Continuous
</li>
<li>Ordinal
</li>
<li>Categorical
</li>
<li>Missing 
</li>
<li>Censored
</li>
</ol>


<p>
Continuous variables are anything measured on a quantitative scale that could be any fractional number. An example
would be something like weight measured in kg. [Ordinal data](<a href="http://en.wikipedia.org/wiki/Ordinal_data">http://en.wikipedia.org/wiki/Ordinal_data</a>) are data that have a fixed, small (&lt; 100) number of levels but are ordered. 
This could be for example survey responses where the choices are: poor, fair, good. [Categorical data](<a href="http://en.wikipedia.org/wiki/Categorical_variable">http://en.wikipedia.org/wiki/Categorical_variable</a>) are data where there
are multiple categories, but they aren't ordered. One example would be sex: male or female. [Missing data](<a href="http://en.wikipedia.org/wiki/Missing_data">http://en.wikipedia.org/wiki/Missing_data</a>) are data
that are missing and you don't know the mechanism. You should code missing values as `NA`. [Censored data](<a href="http://en.wikipedia.org/wiki/Censoring">http://en.wikipedia.org/wiki/Censoring</a><sub>(statistics\)</sub>) are data
where you know the missingness mechanism on some level. Common examples are a measurement being below a detection limit
or a patient being lost to follow-up. They should also be coded as `NA` when you don't have the data. But you should
also add a new column to your tidy data called, "VariableNameCensored" which should have values of `TRUE` if censored 
and `FALSE` if not. In the code book you should explain why those values are missing. It is absolutely critical to report
to the analyst if there is a reason you know about that some of the data are missing. You should also not [impute](<a href="http://en.wikipedia.org/wiki/Imputation">http://en.wikipedia.org/wiki/Imputation</a><sub>(statistics\)</sub>)/make up/
throw away missing observations.
</p>
<p>
In general, try to avoid coding categorical or ordinal variables as numbers. When you enter the value for sex in the tidy
data, it should be "male" or "female". The ordinal values in the data set should be "poor", "fair", and "good" not 1, 2 ,3.
This will avoid potential mixups about which direction effects go and will help identify coding errors. 
</p>
<p>
Always encode every piece of information about your observations using text. For example, if you are storing data in Excel and use a form of colored text or cell background formatting to indicate information about an observation ("red variable entries were observed in experiment 1.") then this information will not be exported (and will be lost!) when the data is exported as raw text.  Every piece of data should be encoded as actual text that can be exported.  
</p>
</div>

</div>
