index.html

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> The instruction list/script</h3>
<div class="outline-text-3" id="text-2-5">


<p>
You may have heard this before, but [reproducibility is kind of a big deal in computational science](<a href="http://www.sciencemag.org/content/334/6060/1226">http://www.sciencemag.org/content/334/6060/1226</a>).
That means, when you submit your paper, the reviewers and the rest of the world should be able to exactly replicate
the analyses from raw data all the way to final results. If you are trying to be efficient, you will likely perform
some summarization/data analysis steps before the data can be considered tidy. 
</p>
<p>
The ideal thing for you to do when performing summarization is to create a computer script (in `R`, `Python`, or something else) 
that takes the raw data as input and produces the tidy data you are sharing as output. You can try running your script
a couple of times and see if the code produces the same output. 
</p>
<p>
In many cases, the person who collected the data has incentive to make it tidy for a statistician to speed the process
of collaboration. They may not know how to code in a scripting language. In that case, what you should provide the statistician
is something called [pseudocode](<a href="http://en.wikipedia.org/wiki/Pseudocode">http://en.wikipedia.org/wiki/Pseudocode</a>). It should look something like:
</p>
<ol>
<li>Step 1 - take the raw file, run version 3.1.2 of summarize software with parameters a=1, b=2, c=3
</li>
<li>Step 2 - run the software separately for each sample
</li>
<li>Step 3 - take column three of outputfile.out for each sample and that is the corresponding row in the output data set
</li>
</ol>


<p>
You should also include information about which system (Mac/Windows/Linux) you used the software on and whether you 
tried it more than once to confirm it gave the same results. Ideally, you will run this by a fellow student/labmate
to confirm that they can obtain the same output file you did. 
</p>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> What you should expect from the analyst</h2>
<div class="outline-text-2" id="text-3">

<p>====================
</p>
<p>
When you turn over a properly tidied data set it dramatically decreases the workload on the statistician. So hopefully
they will get back to you much sooner. But most careful statisticians will check your recipe, ask questions about
steps you performed, and try to confirm that they can obtain the same tidy data that you did with, at minimum, spot
checks.
</p>
<p>
You should then expect from the statistician:
</p>
<ol>
<li>An analysis script that performs each of the analyses (not just instructions)
</li>
<li>The exact computer code they used to run the analysis
</li>
<li>All output files/figures they generated. 
</li>
</ol>


<p>
This is the information you will use in the supplement to establish reproducibility and precision of your results. Each
of the steps in the analysis should be clearly explained and you should ask questions when you don't understand
what the analyst did. It is the responsibility of both the statistician and the scientist to understand the statistical
analysis. You may not be able to perform the exact analyses without the statistician's code, but you should be able
to explain why the statistician performed each step to a labmate/your principal investigator. 
</p>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Acknowledgements</h2>
<div class="outline-text-2" id="text-4">

<p>====================
</p>
<ul>
<li>[Jeff Leek](<a href="http://biostat.jhsph.edu/~jleek/">http://biostat.jhsph.edu/~jleek/</a>) - Wrote the initial version.
</li>
<li>[L. Collado-Torres](<a href="http://bit.ly/LColladoTorres">http://bit.ly/LColladoTorres</a>) - Fixed typos, added links.
</li>
<li>[Nick Reich](<a href="http://people.umass.edu/nick/">http://people.umass.edu/nick/</a>) - Added tips on storing data as text.
</li>
</ul>



</div>
</div>
</div>

</body>
</html>
